app/controllers/admin_controller.rb

  def index
	if (session[:user_name] != "admin") then
		redirect_to '/403'
	end
  	@mailsReceived = Mail.all.where(to: session[:user_name])
  	@mailsCount = Mail.all.count
---
SELECT "mails".* FROM "mails" WHERE "mails"."to" = 'admin'
SELECT COUNT(*) FROM "mails"