app/controllers/sessions_controller.rb

SELECT  "user1s".* FROM "user1s" WHERE "user1s"."email" = ? LIMIT ?  [["email", "medel.vecina@gmail.com"], ["LIMIT", 1]]
---
  def create
    user = User1.find_by(email: params[:email])