app/controllers/user1s_controller.rb

  def index
    #@user1s = User1.all
    @user1s = User1.order(:name)
---
SELECT "user1s".* FROM "user1s" WHERE "user1s"."name" = ?  [["name", "admin"]]

  def show
    @user1 = User1.find(params[:id])
---
SELECT "user1s".* FROM "user1s" WHERE "user1s"."id" = 5 LIMIT 1

  def edit
    @user1 = User1.find(params[:id])
---
SELECT  "user1s".* FROM "user1s" WHERE "user1s"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @user1 = User1.new(user1_params)

    respond_to do |format|
      if @user1.save
---
INSERT INTO "user1s" ("name", "password_digest", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      @user1 = User1.find(params[:id])
      if @user1.update(user1_params)
---
SELECT  "user1s".* FROM "user1s" WHERE "user1s"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "user1s" SET "password_digest" = ?, "updated_at" = ? WHERE "user1s"."id" = ?  [["password_digest", "$2a$10$yN/oDur.9XYlLmz//kJ8FODvqNoqBvcdzKjcYzhPwbR0hxS2oh6T."], ["updated_at", "2017-09-29 09:43:09.361384"], ["id", 8]]

  def destroy
    @user1 = User1.new(user1_params).delete
---
DELETE FROM "user1s" WHERE "user1s"."id" = ?  [["id", 2]]

    def set_user1
      @user1 = User1.find(params[:id])
---
SELECT  "user1s".* FROM "user1s" WHERE "user1s"."id" IS NULL LIMIT ?  [["LIMIT", 1]]